# FileImportedEventArgs Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FileImportedEventArgs Class
Members See Also
---
The event arguments used by the FileImported event.
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2010
# Syntax
C#
---
```text
public class FileImportedEventArgs : RevitAPIPostDocEventArgs
```

Visual Basic
---
```text
Public Class FileImportedEventArgs _
	Inherits RevitAPIPostDocEventArgs
```

Visual C++
---
```text
public ref class FileImportedEventArgs : public RevitAPIPostDocEventArgs
```

# Inheritance Hierarchy
System..::..Object System..::..EventArgs Autodesk.Revit.DB.Events..::..RevitAPIEventArgs Autodesk.Revit.DB.Events..::..RevitAPIPostEventArgs Autodesk.Revit.DB.Events..::..RevitAPIPostDocEventArgs Autodesk.Revit.DB.Events..::..FileImportedEventArgs
# See Also
FileImportedEventArgs Members
Autodesk.Revit.DB.Events Namespace